DataProcessors/КонсольПрослушиванияЗвонковПоСделкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>КонсольПрослушиванияЗвонковПоСделкам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Звонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Звонки</Name>
			<Comment>Реестр входящих и исходящих звонков</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время выполнения звонка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион внешнего абонента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Comment>Сервер телефонии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принят</Name>
					<Comment>Индикатор состоявшегося звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Инициатор звонка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗаписи</Name>
					<Comment>Имя файла с записью звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВходящий</Name>
					<Comment>Направление звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнутренний</Name>
					<Comment>Телефон внутреннего абонента завершившего звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок помещен в очередь</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВыходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок был в очереди, когода абонент прервал вызов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбъектыПривязка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыПривязка</Name>
			<Comment>Привязка объектов к элементам предприятия</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Comment>Владелец объекта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелМобильные</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗвонкиСтатОбщая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗвонкиСтатОбщая</Name>
			<Comment>Общая статистика звонков</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Разговор</Name>
					<Comment>Общая длительность разговора (сек)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ожидание</Name>
					<Comment>Общая длительность ожидания (сек)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЦРазговор</Name>
					<Comment>Длительность разговора абонента с оператором контакт-центра (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОПРазговор</Name>
					<Comment>Длительность разговора абонента с конечным оператором (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЦОжидание</Name>
					<Comment>Длительность ожидания абонентом ответа оператора контакт-центра (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОПОжидание</Name>
					<Comment>Длительность ожидания абонентом ответа конечного оператора (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КЦСсылка</Name>
					<Comment>Контакт-центр ответственный за звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОПСсылка</Name>
					<Comment>Подразделение ответственное за звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПричиныНепринят</Name>
					<Comment>Код причины несостояшегося звонка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторИсходящего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЦАбонент</Name>
					<Comment>Внутренний телефон оператора КЦ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Основание звонка: сигнатура интернет-заявки, задача лояльности и пр.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗвонкиДоп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗвонкиДоп</Name>
			<Comment>Дополнительная аналитика звонков для отчета по целевому трафику</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦелеваяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОУ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АнкетыРасширенные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>АнкетыРасширенные</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВопросАнкетыТребовалОбновитьОтвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомерВопроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СигнатураЗадачи</Name>
					<Comment>Сигнатура задачи лояльности. Совпадает с сигнатурой продажи. Добавлено 16.10.2017</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветКомментарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефонный номер абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Comment>Если номер ответа = 0 тогда на вопрос получен один ответ, если номер ответа =1 тогда это второй ответ на вопрос</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СигнатураЗадачQ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗвонкиСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗвонкиСделки</Name>
			<Comment>Звонки и сделки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/КонсольПрослушиванияЗвонковПоСделкам/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Вопросы = Новый Массив();
	Вопросы.Добавить("Что планирует? (Для ЭКСПЕРТА)");
	Вопросы.Добавить("Результат звонка Эксперт");
	Вопросы.Добавить("Результат звонка по Автосалонам");
	Вопросы.Добавить("Выяснена готовность сдать имеющийся автомобиль");
	Вопросы.Добавить("Выяснена заинтересованность в кредите/лизинге"); 
	Вопросы.Добавить("Предложен предварительный расчет по кредиту/лизингу");
	
	Для i = 0 По Вопросы.Количество() - 1 Цикл
		Вопрос = Справочники.ИдентификаторыСтрок.НайтиПоНаименованию(Вопросы[i]);
		Если Вопрос = Справочники.ИдентификаторыСтрок.ПустаяСсылка() Тогда
			Сообщить("Не найден вопрос "+ Вопрос); 
		КонецЕсли;
		
		ИндексСтрокой 	= ?(i = 0, "", Строка(i));
		ИмяПараметра 	= "Вопрос"+ИндексСтрокой;
		Звонки.Параметры.УстановитьЗначениеПараметра(ИмяПараметра, Вопрос);
	КонецЦикла;
	
	Звонки.ТекстЗапроса = 		
	"ВЫБРАТЬ
	|	Рег.Дата КАК Дата,
	|	Рег.Регион КАК Регион,
	|	Рег.Принят КАК Принят,
	|	Рег.Сигнатура КАК Сигнатура,
	|	Рег.ЭтоВходящий КАК ЭтоВходящий,
	|	Рег.АбонентВнешний КАК АбонентВнешний,
	|	Стат.Исполнитель КАК Оператор,
	|	Рег.Инициатор КАК ТелефонИнициатора,
	|	Рег.АбонентВнутренний КАК ТелефонОператора,
	|	Стат.Исполнитель.ТочкаРазмещения КАК ТочкаРазмещения,
	|	Стат.КЦСсылка КАК КЦСсылка,
	|	Стат.ОПРазговор КАК ОПРазговор,
	|	ЗвонкиДоп.ЦелеваяТочка КАК ЦелеваяТочкаОУ,
	|	ЕСТЬNULL(ВТ04.Ответ, ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрок.ПустаяСсылка)) КАК Ответ,
	|	ЕСТЬNULL(ВТ041.Ответ, ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрок.ПустаяСсылка)) КАК Ответ1,
	|	ЕСТЬNULL(ВТ042.Ответ, ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрок.ПустаяСсылка)) КАК Ответ2,
	|	ЕСТЬNULL(ВТ043.Ответ, ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрок.ПустаяСсылка)) КАК Ответ3,
	|	ЕСТЬNULL(ВТ044.Ответ, ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрок.ПустаяСсылка)) КАК Ответ4,
	|	ЕСТЬNULL(ВТ045.Ответ, ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрок.ПустаяСсылка)) КАК Ответ5,
	|	ЕСТЬNULL(ЗвонкиСделки.Наименование, """") КАК Сделка,
	|	ЕСТЬNULL(ЗвонкиСделки.Ссылка, """") КАК СделкаСсылка
	|ИЗ
	|	РегистрСведений.Звонки КАК Рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыПривязка КАК Иниц
	|		ПО (Иниц.Объект = Рег.Инициатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК Стат
	|		ПО (Стат.Сигнатура = Рег.Сигнатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиДоп КАК ЗвонкиДоп
	|		ПО Рег.Сигнатура = ЗвонкиДоп.Сигнатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АнкетыРасширенные.СрезПоследних(, Вопрос = &Вопрос) КАК ВТ04
	|		ПО Рег.Сигнатура = ВТ04.Сигнатура
	|			И Рег.АбонентВнешний = ВТ04.Телефон
	|			И (ВТ04.Вопрос = &Вопрос)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АнкетыРасширенные.СрезПоследних(, Вопрос = &Вопрос1) КАК ВТ041
	|		ПО Рег.Сигнатура = ВТ041.Сигнатура
	|			И Рег.АбонентВнешний = ВТ041.Телефон
	|			И (ВТ041.Вопрос = &Вопрос1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АнкетыРасширенные.СрезПоследних(, Вопрос = &Вопрос2) КАК ВТ042
	|		ПО Рег.Сигнатура = ВТ042.Сигнатура
	|			И Рег.АбонентВнешний = ВТ042.Телефон
	|			И (ВТ042.Вопрос = &Вопрос2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АнкетыРасширенные.СрезПоследних(, Вопрос = &Вопрос3) КАК ВТ043
	|		ПО Рег.Сигнатура = ВТ043.Сигнатура
	|			И Рег.АбонентВнешний = ВТ043.Телефон
	|			И (ВТ043.Вопрос = &Вопрос3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АнкетыРасширенные.СрезПоследних(, Вопрос = &Вопрос4) КАК ВТ044
	|		ПО Рег.Сигнатура = ВТ044.Сигнатура
	|			И Рег.АбонентВнешний = ВТ044.Телефон
	|			И (ВТ044.Вопрос = &Вопрос4)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АнкетыРасширенные.СрезПоследних(, Вопрос = &Вопрос5) КАК ВТ045
	|		ПО Рег.Сигнатура = ВТ045.Сигнатура
	|			И Рег.АбонентВнешний = ВТ045.Телефон
	|			И (ВТ045.Вопрос = &Вопрос5)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСделки КАК ЗвонкиСделки
	|		ПО Рег.Сигнатура = ЗвонкиСделки.Сигнатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Звонки.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	
	//Отбор по периоду
	//-----------------
	Начало = '00010101';
	Начало = ?(ЗначениеЗаполнено(Параметры.Начало),	Параметры.Начало, НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)));	
	ЭлОтбораНачало = Звонки.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбораНачало.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Дата");
	ЭлОтбораНачало.ВидСравнения			=	ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлОтбораНачало.ПравоеЗначение		=	Начало;
	ЭлОтбораНачало.Использование		=	Истина;
	
	Окончание = ?(ЗначениеЗаполнено(Параметры.Окончание), Параметры.Окончание, КонецДня(ТекущаяДата()));
	ЭлОтбораОкончание =Звонки.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбораОкончание.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Дата");
	ЭлОтбораОкончание.ВидСравнения		=	ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлОтбораОкончание.ПравоеЗначение	=	Окончание;
	ЭлОтбораОкончание.Использование		=	Истина;
	
	//Разговор с ОП состоялся
	//------------------------
	ЭлОтбораОПРазговор =Звонки.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбораОПРазговор.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("ОПРазговор");
	ЭлОтбораОПРазговор.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Больше;
	ЭлОтбораОПРазговор.ПравоеЗначение	=	0;
	ЭлОтбораОПРазговор.Использование	=	Истина;
		
	ЭлОтбораКЦ =Звонки.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбораКЦ.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("КЦСсылка");
	ЭлОтбораКЦ.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбораКЦ.ПравоеЗначение	=	Справочники.Предприятие.НайтиПоКоду("000000265");
	ЭлОтбораКЦ.Использование	=	Истина;

	#Область Группа_ИЛИ_ПокупкаБУ_или_Сделка 	
	ГрПокупкаБУилиСделка = Звонки.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГрПокупкаБУилиСделка.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ЭлОтбора = ГрПокупкаБУилиСделка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Сделка");
	ЭлОтбора.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлОтбора.Использование		=	Истина;
	
	ЭлОтбора = ГрПокупкаБУилиСделка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение		=	Новый ПолеКомпоновкиДанных("Ответ");
	ЭлОтбора.ВидСравнения		=	ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ПравоеЗначение		=	Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Покупка б/у");
	ЭлОтбора.Использование		=	Истина;
	#КонецОбласти
	
	//Целевая точка - автосалон или эксперт
	//--------------------------------------
	СпГруппЦелевыхТочек = Новый СписокЗначений();
	СпГруппЦелевыхТочек.Добавить(Справочники.ТочкиЦелевые.НайтиПоКоду("000000052")); 	// Автомобили с пробегом
	СпГруппЦелевыхТочек.Добавить(Справочники.ТочкиЦелевые.НайтиПоКоду("000000001"));	// Луидор-автосалоны
	
	ЭлОтбора = Звонки.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("ЦелеваяТочкаОУ");
	ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
	ЭлОтбора.ПравоеЗначение	=	СпГруппЦелевыхТочек;
	ЭлОтбора.Использование	=	Истина;

	//Заголовки колонок вопросов
	//---------------------------
	Элементы.ЗвонкиОтвет.Заголовок 		= Вопросы[0];
	Элементы.ЗвонкиОтвет1.Заголовок 	= Вопросы[1];
	Элементы.ЗвонкиОтвет2.Заголовок 	= Вопросы[2];
	Элементы.ЗвонкиОтвет3.Заголовок 	= Вопросы[3];
	Элементы.ЗвонкиОтвет4.Заголовок 	= Вопросы[4];
	Элементы.ЗвонкиОтвет5.Заголовок 	= Вопросы[5];
КонецПроцедуры

&НаКлиенте
Процедура ОбрПриЗакрытии(Парам1, Парам2) Экспорт
	//ЭтаФорма.Элементы.Звонки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗвонкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.Звонки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ЗвонкиСделка" Тогда
		НавСсылка = ОбщегоНазначения.GUID_2_ref(ТекДанные.СделкаСсылка);
		НавСсылка = СтрЗаменить("e1c://server/MainAppL/asc_oper#e1cib/data/Документ.СделкаРеализации?ref=811200155d53e00011e9b754c26d77b5", "811200155d53e00011e9b754c26d77b5", НавСсылка);
		ПерейтиПоНавигационнойСсылке(НавСсылка);
	Иначе
		ОбрПриЗакрытии = Новый ОписаниеОповещения("ОбрПриЗакрытии", ЭтаФорма);
		
		Парам = Новый Структура();
		Парам.Вставить("Сигнатура", ТекДанные.Сигнатура);
		Если Лев(ТекДанные.Сигнатура,1)="1" Тогда
			ОткрытьФорму("РегистрСведений.Звонки.Форма.ФормаВходящегоЧтение", Парам, ЭтаФорма,,,,ОбрПриЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ОткрытьФорму("РегистрСведений.Звонки.Форма.ФормаИсходящегоЧтение", Парам, ЭтаФорма,,,,ОбрПриЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
